app/controllers/comments_controller.rb

  def index
    if params[:url].blank?
      @comments = Comment.all
    else
      @comments = Comment.find(:all, :conditions => ["url = ?", params[:url].join("/")])
---
SELECT * FROM "comments" WHERE (url = 'http://dev:3000/3920')
SELECT * FROM "comments" WHERE ("comments"."url" = 'http://dev:3000/3922') LIMIT 1

  def create
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("name", "updated_at", "body", "url", "link", "created_at") VALUES('komagata', '2008-12-13 18:19:16', 'aaa